<a href="https://colab.research.google.com/github/kokorina-irina/ML/blob/master/LAB2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
pd.set_option("display.width", 70)

In [3]:

data = pd.read_csv('adult.data.csv')
data.head()

   age         workclass  fnlwgt  ... hours-per-week  native-country salary
0   39         State-gov   77516  ...             40   United-States  <=50K
1   50  Self-emp-not-inc   83311  ...             13   United-States  <=50K
2   38           Private  215646  ...             40   United-States  <=50K
3   53           Private  234721  ...             40   United-States  <=50K
4   28           Private  338409  ...             40            Cuba  <=50K

[5 rows x 15 columns]

# 1. Сколько мужчин и женщин ( половой признак) представлены в этом наборе данных?

In [5]:
data["sex"].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

# 2. Каков средний возраст (возрастная характеристика) женщин?

In [6]:
data[data["sex"] == "Female"]["age"].mean()

36.85823043357163

# 3. Какова процентная доля граждан Германии (родная страна)?

In [7]:
print("{0:%}".format(data[data["native-country"] == "Germany"]
                     .shape[0] / data.shape[0]))

0.420749%

#4-5. Каковы среднее и стандартное отклонение возраста для тех, кто зарабатывает более 50 тыс. в год ( функция зарплаты), и тех, кто зарабатывает менее 50 тыс. в год?

In [8]:
ages1 = data[data["salary"] == "<=50K"]["age"]
ages2 = data[data["salary"] ==  ">50K"]["age"]
print("<=50K: = {0} ± {1} years".format(ages1.mean(), ages1.std()))
print(" >50K: = {0} ± {1} years".format(ages2.mean(), ages2.std()))

<=50K: = 36.78373786407767 ± 14.020088490824813 years
 >50K: = 44.24984058155847 ± 10.51902771985177 years

#6. Правда ли, что люди, которые зарабатывают более 50 тысяч, имеют по крайней мере высшее образование? (образование-бакалавры, Проф-школа, ДОЦ-acdm, ДОЦ-voc, магистры или докторантура характеристика)

In [9]:
high_educations = set(["Bachelors", "Prof-school", "Assoc-acdm",
                       "Assoc-voc", "Masters", "Doctorate"])
def high_educated(e):
    return e in high_educations

data[data["salary"] == ">50K"]["education"].map(high_educated).all()

False

# 7. Отображение статистики возраста для каждой расы ( функция расы) и каждого пола (функция пола). Используйте groupby () и describe (). Найдите максимальный возраст мужчин Амер-Индо-эскимосской расы.

In [10]:
data.groupby(["race", "sex"])["age"].describe()

                             count       mean        std  ...   50%    75%   max
race               sex                                    ...
Amer-Indian-Eskimo Female    119.0  37.117647  13.114991  ...  36.0  46.00  80.0
                   Male      192.0  37.208333  12.049563  ...  35.0  45.00  82.0
Asian-Pac-Islander Female    346.0  35.089595  12.300845  ...  33.0  43.75  75.0
                   Male      693.0  39.073593  12.883944  ...  37.0  46.00  90.0
Black              Female   1555.0  37.854019  12.637197  ...  37.0  46.00  90.0
                   Male     1569.0  37.682600  12.882612  ...  36.0  46.00  90.0
Other              Female    109.0  31.678899  11.631599  ...  29.0  39.00  74.0
                   Male      162.0  34.654321  11.355531  ...  32.0  42.00  77.0
White              Female   8642.0  36.811618  14.329093  ...  35.0  46.00  90.0
                   Male    19174.0  39.652498  13.436029  ...  38.0  49.00  90.0

[10 rows x 8 columns]

In [11]:
data[(data["race"] == "Amer-Indian-Eskimo")
     & (data["sex"] == "Male")]["age"].max()

82

#8. Среди кого больше доля тех, кто зарабатывает много (>50 тыс.): женатых или одиноких мужчин (>характеристика семейного положения)? Считайте женатыми тех, кто имеет семейное положение, начиная с женатого (женат-гражданский супруг, женат-отсутствующий супруг или женат-AF-супруг), остальные считаются холостяками.

In [12]:
def is_married(m):
    return m.startswith("Married")

data["married"] = data["marital-status"].map(is_married)
(data[(data["sex"] == "Male") & (data["salary"] == ">50K")]
     ["married"].value_counts())

True     5965
False     697
Name: married, dtype: int64

# 9. Какое максимальное количество часов человек работает в неделю (функция часов в неделю)? Сколько людей работает такое количество часов, и каков процент тех, кто зарабатывает много (>50K) среди них?

In [13]:
m = data["hours-per-week"].max()
print("Maximum is {} hours/week.".format(m))

people = data[data["hours-per-week"] == m]
c = people.shape[0]
print("{} people work this time at week.".format(c))

s = people[people["salary"] == ">50K"].shape[0]
print("{0:%} get >50K salary.".format(s / c))

Maximum is 99 hours/week.
85 people work this time at week.
29.411765% get >50K salary.

# 10. Подсчитайте среднее время работы ( часов в неделю ) для тех, кто зарабатывает мало и много ( зарплата ) для каждой страны (родной страны ). А что это будет для Японии?

In [14]:
p = pd.crosstab(data["native-country"], data["salary"],
                values=data['hours-per-week'], aggfunc="mean")
p

salary                          <=50K       >50K
native-country
?                           40.164760  45.547945
Cambodia                    41.416667  40.000000
Canada                      37.914634  45.641026
China                       37.381818  38.900000
Columbia                    38.684211  50.000000
Cuba                        37.985714  42.440000
Dominican-Republic          42.338235  47.000000
Ecuador                     38.041667  48.750000
El-Salvador                 36.030928  45.000000
England                     40.483333  44.533333
France                      41.058824  50.750000
Germany                     39.139785  44.977273
Greece                      41.809524  50.625000
Guatemala                   39.360656  36.666667
Haiti                       36.325000  42.750000
Holand-Netherlands          40.000000        NaN
Honduras                    34.333333  60.000000
Hong                        39.142857  45.000000
Hungary                     31.300000  50.000000
India                       38.233333  46.475000
Iran                        41.440000  47.500000
Ireland                     40.947368  48.000000
Italy                       39.625000  45.400000
Jamaica                     38.239437  41.100000
Japan                       41.000000  47.958333
Laos                        40.375000  40.000000
Mexico                      40.003279  46.575758
Nicaragua                   36.093750  37.500000
Outlying-US(Guam-USVI-etc)  41.857143        NaN
Peru                        35.068966  40.000000
Philippines                 38.065693  43.032787
Poland                      38.166667  39.000000
Portugal                    41.939394  41.500000
Puerto-Rico                 38.470588  39.416667
Scotland                    39.444444  46.666667
South                       40.156250  51.437500
Taiwan                      33.774194  46.800000
Thailand                    42.866667  58.333333
Trinadad&Tobago             37.058824  40.000000
United-States               38.799127  45.505369
Vietnam                     37.193548  39.200000
Yugoslavia                  41.600000  49.500000

In [15]:
p.loc["Japan"]

salary
<=50K    41.000000
>50K     47.958333
Name: Japan, dtype: float64